
## Plan Result (section-manager-lambda-cdk-production)

[CI link](https://github.com/Pocket/content-monorepo/actions/runs/14246354174)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.section-manager-sqs-lambda_D7365DAE


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.section-manager-sqs-lambda_D7365DAE will be updated in-place
  ~ resource "aws_lambda_function" "section-manager-sqs-lambda_D7365DAE" {
        id                             = "SectionManagerLambda-Prod-SQS-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SectionManagerLambda-Prod-SQS-Function:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SectionManagerLambda-Prod-SQS-Function:16/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "content"
            "component_code" = "content-sectionmanagerlambda"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "service"        = "SectionManagerLambda"
        }
      ~ version                        = "16" -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"     = "c949e709fa3114713051f0fff29c7a7b736f55c4" -> null
              + "TEST"        = "test"
                # (5 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label section-manager-lambda-cdk-production/add-or-update: POST https://api.github.com/repos/Pocket/content-monorepo/issues/286/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":286,"Program":"tfcmt","SHA1":"3d9af78cfd9cfaecab6154c6ad259a3858eebf6f","Target":"section-manager-lambda-cdk-production","Vars":{},"WorkflowName":"Section Manager Lambda"} -->